package practice.ilist;

// зададим абстрактные методы для работы со структурой данных "лист/ list" (список чего то)
// для любых типов данных  int boolean, Integar, String, StringBuilder, Employee, Car, Pet, Photo, Book ....
public interface IList {

    // добавить элемент списка

    // добавить (вставить) элемент по индексу

    // удалить элемент из списка

    // обновить элемент в списке

    // есть ли  элемент в списке

    // найти элемент по его индексу

    // зная элемент, найти его индекс

    //

}
