package practice.ilist;

// зададим абстрактные методы для работы со структурой данных "лист/ list" (список чего то)
// для любых типов данных  int boolean, Integar, String, StringBuilder, Employee, Car, Pet, Photo, Book ....
public interface IList {

    // узнать размер списка

    // если что то в списке или он пустой

    // есть ли  элемент в списке

    // добавить элемент списка

    // добавить (вставить) элемент по индексу

    // удалить элемент из списка по индексу

    // удалить элемент, из списка если он есть (а все ли элементы мы удалим)

    // обновить элемент в списке по его индексу

    // найти элемент по его индексу

    // зная элемент, найти его индекс

    // удалить все из списка

    // ищем  индекс элемента с конца списка



}
